InformationRegisters/ВнешнееПроизводство.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ВнешнееПроизводство</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаОжидаемогоОкончанияПодрядчиком</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРеальнойГотовности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСогласования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоставкаНаСклад</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отмена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Подрядчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипВнешнегоПроизводства</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыВнешнегоПроизводства</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Комплект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Композиции</v8:Type>
						<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РегистраторДвижения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.НазначениеВнешнегоПроизводства</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтменитьВнешнееПроизводство</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/омВнешнееПроизводство/Ext/Module.bsl
Функция СоздатьЗадачуВнешнегоПроизводства(ОбъектТЗ, Проект = Неопределено, Исполнитель = Неопределено, Комментарий = "") Экспорт

    НоваяЗадача 				= Задачи.ЗадачаВнешнееПроизводство.СоздатьЗадачу();
	
	НоваяЗадача.Автор 			= ПараметрыСеанса.ТекущийПользователь;
	НоваяЗадача.Дата 			= ТекущаяДата();
	НоваяЗадача.Исполнитель 	= Исполнитель;
	НоваяЗадача.Комментарий		= Комментарий;
	НоваяЗадача.Наименование	= Строка(ОбъектТЗ) + ".Внешняя";
	НоваяЗадача.ОбъектТЗ		= ОбъектТЗ;
	НоваяЗадача.Проект			= ?(Проект = Неопределено, ОбъектТЗ.Проект, Проект);
	
	НоваяЗадача.Записать();
	
	Возврат НоваяЗадача.Ссылка;

КонецФункции // СоздатьЗадачуВнешнегоПроизводства()

Функция ТипВнешнегоПроизводства(ОбъектТЗ) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВнешнееПроизводствоСрезПоследних.ТипВнешнегоПроизводства КАК ТипВнешнегоПроизводства,
		|	МАКСИМУМ(ВнешнееПроизводствоСрезПоследних.Период) КАК Период,
		|	ЗадачаВнешнееПроизводство.Ссылка КАК ЗадачаВнешнегоПроизводства
		|ИЗ
		|	РегистрСведений.ВнешнееПроизводство.СрезПоследних КАК ВнешнееПроизводствоСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ Задача.ЗадачаВнешнееПроизводство КАК ЗадачаВнешнееПроизводство
		|		ПО ВнешнееПроизводствоСрезПоследних.Комплект = ЗадачаВнешнееПроизводство.ОбъектТЗ
		|ГДЕ
		|	ВнешнееПроизводствоСрезПоследних.Комплект = &Комплект
		|	И НЕ ЗадачаВнешнееПроизводство.Выполнена
		|
		|СГРУППИРОВАТЬ ПО
		|	ВнешнееПроизводствоСрезПоследних.ТипВнешнегоПроизводства,
		|	ЗадачаВнешнееПроизводство.Ссылка";
	
	Запрос.УстановитьПараметр("Комплект", ОбъектТЗ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Новый Структура("ТипВнешнегоПроизводства, ЗадачаВнешнегоПроизводства", Выборка.ТипВнешнегоПроизводства, Выборка.ЗадачаВнешнегоПроизводства);
	КонецЦикла;
	
    Возврат Неопределено;
КонецФункции // ТипВнешнегоПроизводства()
